import math

def f(x):#συνάρτηση για τον υπολογισμό της τιμής της συνάρτησης  
    return math.exp(math.sin(x)*math.sin(x)*math.sin(x))+x**6-2*x**4-x**3-1;#επιστοφή της τιμής της συνάρτησης

def dixotomisi(a,b):#συνάρτηση για τον υπολογισμό της ρίζας της συνάρτησης στο [a,b]
    e=0.000005;#(1/2)*(10^(-5))
    N=(math.log(b-a)-math.log(e))/math.log(2);#υπολογισμός επαναλήψεων
    m=(a+b)/2;#υπολογισμός μέσου διαστήματος
    k=0;
    if(f(m)!=0):#αν δεν θρεθεί ρίζα συνεχιζω
        i=0;    
        while (i<=N):
            if(f(m)*f(a)<0):
                b=m;#ορισμός νέου διαστήματος [a,m]
            else:
                a=m;#ορισμός νέου διαστήματος [m,b]
            m=(a+b)/2;
            if(f(m)==0):#βρέθηκε η ρίζα
                return(m);
            i=i+1;
            k=k+1;
        print('Έγιναν',k,'επαναλήψεις:');    
        return(m);    
    else:#βρέθηκε κατευθείαν η ρίζα
        k=k+1;
        print('Έγινε',k,'επανάληψη:');
        return(m);
        
print("Οι ρίζες της συνάρτησης είναι οι εξής:")
print('');
print(dixotomisi(-2,-1));#ρίζα της συνάρτησης στο [-2,-1]
print('-----------------------')
print(dixotomisi(-1,1)); #ρίζα της συνάρτησης στο [-1,1]
print('-----------------------')
print(dixotomisi(1,2));#ρίζα της συνάρτησης στο [1,2]