import math

def f(x):#συνάρτηση για τον υπολογισμό της τιμής της συνάρτησης  
    return math.exp(math.sin(x)*math.sin(x)*math.sin(x))+x**6-2*x**4-x**3-1;#επιστοφή της τιμής της συνάρτησης


def  SecantMethod(a,b):#συνάρτηση για τον υπολογισμό της ρίζας της συνάρτησης στο [a,b]
    i=0;#αριθμός επαναλήψεων
    e=0.000005;#(1/2)*(10^(-5))
    x0=a;#ορισμός αρχικού σημείου
    x1=b;
    x2=x1-(f(x1)*(x1-x0))/(f(x1)-f(x0));
    i+=1;
    while(math.fabs(x2-x1)>e):
        x0=x1;
        x1=x2;
        x2=x1-(f(x1)*(x1-x0))/(f(x1)-f(x0));
        i+=1;
    print("Έγιναν",i,"επαναλήψεις:")    
    return x1;    
    
print("Οι ρίζες της συνάρτησης είναι οι εξής:")
print('');
print(SecantMethod(-2,-1));#ρίζα της συνάρτησης στο [-2,-1] 
print('-----------------------')
print(SecantMethod(-1,1)); #ρίζα της συνάρτησης στο [-1,1]
print('-----------------------')
print(SecantMethod(1,2));#ρίζα της συνάρτησης στο [1,2]