import math;

def fx(x):#συνάρτηση για τον υπολογισμό της τιμής τoυ ημιτόνου  
    return math.sin(x);#επιστοφή της τιμής της συνάρτησης
    
def integralf(x,f,a,b,n):#συνάρτηση για τον υπολογισμό του ολοκληρώματος της συνάρτησης του ημιτόνου
    fd=f[0]+f[n];
    for i in range(1,n):
        if(i%2==0):
            fd+=2*f[i];
        else:
            fd+=4*f[i];
    return ((b-a)/(3*n))*fd;   
        

#άκρα διαστήματος [a,b]
a=0;
b=math.pi/2;
ba=b-a;#Μήκος διαστήματος ολοκλήρωσης
numberPoints=11;#Πλήθος σημείων
n=numberPoints-1;#Πλήθος υποδιαστημάτων    
rangeSpaces=(b-a)/n;#Εύρος υποδιαστημάτων
x=[];#λίστα με τα x για k=0,...,n
x0=0;
for k in range(n+1):
    x.append(x0+k*(rangeSpaces));

f=[];#Λίστα με τις τιμές της συνάρτησης για i=0,...,n
for i in x:
    f.append(fx(i));
fxdx=integralf(x,f,a,b,n);#Προσεγγιστική τιµή του ολοκληρώµατος της συνάρτησης του ημιτόνου
M=1;#Μέγιστο σε απόλυτη τιμή της τέταρτης παραγώγου του ημιτόνου
e=(((b-a)**5)/(180*n**4))*M;#Σφάλμα προσέγγισης
print("Η προσεγγιστική τιμή του ολοκληρώματος της συνάρτησης του ημιτόνου με τη μέθοδο Simpson είναι",fxdx);
print("Το σφάλμα προσέγγισης είναι |e|<=",e);
